 /**************************************************************************************************************
  * FileName     : SmartPot_Basic
  * Description  : 스마트화분(워터펌프 포함)
  * Author       : 이인정
  * CopyRight    : (주)한국공학기술연구원(www.ketri.re.kr)
  * Warning      : Arduino IDE에서 u8g2 라이브러리를 추가해서 컴파일 해야함
  * Created Date : 2021.09.02
  * Modified     : 2022.01.12 : SCS : 소스 크린징
  * Modified     : 2022.10.03 : SCS : support arduino uno with ET-Upboard
  * Modified     : 2022.11.23 : YSY : 소스 크린징, 수분값 %변환, 시리얼통신값변경(9600->115200), OLED 모터상태 출력 추가
  * Modified     :
 **************************************************************************************************************/

//==============================================================================================================
// Include & definition
//==============================================================================================================
#include "pins_arduino.h"                                                // support arduino uno with ET-Upboard

// OLED 제어를 위한 라이브러리 불러오기
#include "oled_u8g2.h"
OLED_U8G2 oled;

// 토양수분센서를 이용할 ET-보드의 핀 설정
const int moisture_pin = A3;

// ET-보드에서 사용할 모터 설정 (Motor-L)
const int pin1 = D2;                             
const int pin2 = D3;

// 토양 수분 센서 임계값
const int threshold = 30;                                                // 30%


//==============================================================================================================
void setup()
//==============================================================================================================
{
  Serial.begin(115200);                                                  // 시리얼통신 준비
  pinMode(pin1, OUTPUT);
  pinMode(pin2, OUTPUT);
  oled.setup();
}

//==============================================================================================================
void loop()
//==============================================================================================================
{
  display_oled();
  delay(1);
}

//==============================================================================================================
void setup_oled()
//==============================================================================================================
{
    pinMode(SDA, INPUT);
    pinMode(SCL, INPUT);
}

//==============================================================================================================
void display_oled()
//==============================================================================================================
{
  // 토양수분센서값 보정
  int moistureValue = map(analogRead(moisture_pin), 0, 4095, 100, 0);   // 토양수분 센서 % 읽기
  Serial.print("토양 수분 센서값 : ");
  Serial.println(moistureValue);
  Serial.println("----------------------");

  if (moistureValue < threshold) {                                       // 토양수분 센서값이 threshold 미만이면
    digitalWrite(pin1, HIGH);                                            // 워터펌프 작동
    digitalWrite(pin2, LOW);                                             //
    } else {
    digitalWrite(pin1, LOW);                                             // 작동 멈춤
    digitalWrite(pin2, LOW);                                             //
    }


  // OLED 텍스트 표시
  char text[32] = "moist: ";                                             // text -> 수분값 표시
  char value[32];
  String str = String(moistureValue, DEC);
  str.toCharArray(value,6);
  strcat(text,value);
  strcat(text,"%");

  char text2[32] = "pump: ";                                             // text2 -> 펌프상태 표시
  int pump_state = digitalRead(pin1);                                    // 워터펌프 상태 읽기
  if (pump_state == 1) {
    strcat(text2, "On");
  }
  else {
    strcat(text2, "Off");
  }

  oled.setLine(1,"* Smart POT *");                                       // OLED 첫 번째 줄
  oled.setLine(2,text);                                                  // OLED 두 번째 줄
  oled.setLine(3,text2);                                                 // OLED 세 번째 줄
  oled.display();
  delay(500);
}

//==============================================================================================================
//
// (주)한국공학기술연구원 http://et.ketri.re.kr
//
//==============================================================================================================
